<a href="https://colab.research.google.com/github/congltk1234/BaitapChuong4/blob/master/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Pandas**

In [ ]:
#Khai báo thư viện
import pandas as pd

**series:**(1 chiều)

Là dữ liệu có dạng : `Series([data, index, dtype, name, copy, . . . ])`

**Khởi tạo series:**  `s = pd.Series(data, index=index)`

In [ ]:
s = pd.Series([0,1,2,3], index=["a","b","c","d"])
print(s)

a    0
b    1
c    2
d    3
dtype: int64

In [ ]:
#Áp dụng được với dict
d = {"b": 1, "a": 0, "c": 2}
pd.Series(d)

b    1
a    0
c    2
dtype: int64

**DataFrame** (2 chiều)

Là dữ liệu có dạng: `DataFrame([data, index, columns, dtype, copy])`

In [ ]:
#Dữ liệu:
s = {'một': pd.Series([1., 2., 3., 5.], index=['a', 'b', 'c', 'e']),
     'hai': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}

Tạo DataFrame từ dict s

In [ ]:
df = pd.DataFrame(s)
print(df)

   một  hai
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0
e  5.0  NaN

**Sort dữ liệu:**

In [ ]:
df1 = pd.DataFrame({"one": [2, 1, 1, 1], "two": [1, 3, 2, 4], "three": [5, 4, 3, 2]})
df1.sort_values(by="two")

   one  two  three
0    2    1      5
2    1    2      3
1    1    3      4
3    1    4      2

In [ ]:
#Sắp xếp mảng theo thứ tự tăng dần
df1.nsmallest(4, "three")

   one  two  three
3    1    4      2
2    1    2      3
1    1    3      4
0    2    1      5

In [ ]:
#Sắp xếp giảm dần theo cột "one", "three"
df1.nlargest(4, ["one","three"])

   one  two  three
0    2    1      5
1    1    3      4
2    1    2      3
3    1    4      2

**Combine Data:**

In [ ]:
df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [1, 2, 3, 5]})
df1

  lkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5

In [ ]:
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [5, 6, 7, 8]})
df2

  rkey  value
0  foo      5
1  bar      6
2  baz      7
3  foo      8

In [ ]:
#Merge 2 dataframe: Gộp 2 dataframe với nhau 
df1.merge(df2, left_on='lkey', right_on='rkey')

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

**Đọc file CSV**

In [ ]:
#Đọc CSV từ url:
url = 'https://www.k12.gov.sk.ca/sds/xml/Schoollistactive.csv'
data = pd.read_csv(url)
print(data.head(10))

                                School Name  ...                School Primary Email
0                                33 Central  ...  contact.33central@cornerstonesd.ca
1  4 Directions Child & Family Services Inc  ...                                 NaN
2                    Abbey Hutterite School  ...                sjensen@chinooksd.ca
3                 Aberdeen Composite School  ...                aberdeen@spiritsd.ca
4                    Aden Bowman Collegiate  ...         AdenBowmanSchool@spsd.sk.ca
5                        Ahtahkakoop School  ...           shaun.sasakamoose@tsec.ca
6                            Alameda School  ...    contact.alameda@cornerstonesd.ca
7              Albert E. Peacock Collegiate  ...      swanson.dustin@prairiesouth.ca
8                             Albert School  ...                    albert@rbe.sk.ca
9                All Saints Catholic School  ...             lenni.zanidean@htcsd.ca

[10 rows x 10 columns]

In [ ]:
#Đọc dữ liệu từ file excel (dạng csv) trên máy tính vào bộ nhớ và in ra 10 dòng đầu tiên
df = pd.read_csv("pandas.csv")
print(df.head(10))

   Name  Age
0   Lan    3
1    Ba    4
2   Mai    5
3   Hai    6
4  Linh    7
5   Nga   11
6   Hoa    5
7    Bo   10
8   Nam    9
9  Kiki   11

**Đọc file JSON:**

In [ ]:
#Đọc JSON từ url:
url = "https://api.exchangerate-api.com/v4/latest/USD"
js = pd.read_json(url)
print(js.head(10))

    base       date  time_last_updated       rates
AED  USD 2021-01-08         1610064001    3.672500
ARS  USD 2021-01-08         1610064001   84.663182
AUD  USD 2021-01-08         1610064001    1.289781
BGN  USD 2021-01-08         1610064001    1.592705
BRL  USD 2021-01-08         1610064001    5.312659
BSD  USD 2021-01-08         1610064001    1.000000
CAD  USD 2021-01-08         1610064001    1.269276
CHF  USD 2021-01-08         1610064001    0.884095
CLP  USD 2021-01-08         1610064001  696.360240
CNY  USD 2021-01-08         1610064001    6.470618